welf/Applications/php/SavingAlert/app/Views/backend/manage_users.php


                        $builder1 = $db->table("front_users");
                        $builder1->select("*");
                        $query1 = $builder1->get();
---
SELECT *
FROM `front_users`