welf/Applications/php/SavingAlert/app/Controllers/Backend/ManageUsers.php

UPDATE `front_users` SET `reciver` = 'N'
WHERE `id` = '49'
---
    public function enable_requester(){

        if(is_back_user_logged()){

            $postData = $this->request->getRawInput(true);

            if($postData["don_id"] != ""){

                $ver = $postData["ver"];
                $ver = ($ver == 'Y') ? 'N' : 'Y';

                $db = \Config\Database::connect();

                $builder3 = $db->table("front_users");

                $datamn = [
                    'reciver'  => $ver,
                ];

                $builder3->where('id', $postData["don_id"]);

                $builder3->update($datamn);