welf/Applications/php/SavingAlert/app/Helpers/shuja_helper.php

function user_phone_verified(){

    $db = \Config\Database::connect();

    $builder = $db->table("front_users");

    $builder->select("phone_verified");
    $builder->where("id", front_user_id());
    $query = $builder->get();
---
SELECT `phone_verified`
FROM `front_users`
WHERE `id` = '41'

function get_user_info($front_id){

    $db = \Config\Database::connect();

    $builder = $db->table("front_users");

    $builder->select("*");
    $builder->where("id", $front_id);
    $query = $builder->get();
---
SELECT *
FROM `front_users`
WHERE `id` = '41'

function get_donation_data($don_id){

    $db = \Config\Database::connect();

    $builder = $db->table("donation_table");

    $builder->select("*");
    $builder->where("id", $don_id);
    $query = $builder->get();
---
SELECT *
FROM `donation_table`
WHERE `id` = '68'